package com.cheche365.cheche.manage.common.constants

/**
 * #
 * Created by yinJianBin on 2017/12/15.
 */
class OfflineDataExcelHeaderContants {
    static final List<String> FANHUA_HEADERS = [
            '序号', '收表日期', '出单时间', '出单机构', '付款单位', '保险公司', '平台/来源', '代理人身份证', '车主', '车牌号', '保费总额', '交强险', '车船税', '商业险', '交强点位', '商业点位', '渠优（保酷）', '保单号', '发动机号', '车架号', '交强点位', '商业点位', '天道佣金', '结算给泛华'
    ]

    static final List<String> FANHUA_ADDED_HEADERS = [
            '出单日期', '出单机构', '付款单位', '保险公司', '代理人', '代理人身份证号', '收款银行卡号', '投保人姓名', '车牌号', '发动机号', '车架号', '车型', '初登日期', '车身颜色', '约定行驶区域', '使用性质', '号牌种类', '车身自重', '过户车', '机动车种类', '号牌颜色', '使用年限', '座位数', '新车购置价', '发动机排量', '车辆用户类型', '平均行驶里程', '保单号', '保费总额', '险种', '车船税', '投保保险公司代码', '起保日期', '代理人交强点位', '代理人商业点位', '商业险种细节'
    ]

    static final List<String> FANHUA_TEMP_HEADERS = [
            '序号', '出单网点（系统）', '归属机构', '团队名称（系统）', '代理人（系统）', '代理人编码', '出单日期', '起保日期', '审单日期', '保单号', '批单号', '保单类型', '业务类型', '车辆种类', '销售方式', '车牌号', '被保险人', '保费', '税后保费', '保险公司', '险种', '费率等级', '总收入费率', '总收入金额', '税后收入', '手续费率1', '手续费1', '手续费1（增）', '开票日期1', '发票号', '收款日期1', '结算批次号1', '手续费率2', '手续费2', '手续费2(增）', '开票日期2', '发票号', '收款日期2', '结算批次号2', '手续费率3', '手续费3', '手续费3(增）', '开票日期3', '发票号', '收款日期3', '结算批次号3', '手续费率4（调整）', '手续费4', '手续费4（增）', '开票日期4', '发票号', '收款日期4', '结算批次号4', '未收手续费', '总佣金率', '总佣金', '佣金率', '佣金', '付佣日期1', '成本属期1', '佣金率调整率', '佣金调整', '调整付佣日期', '调整成本属期1', '推广费率', '推广费', '支付日期2', '成本归属期2', '佣金2补发率', '佣金2补发', '支付日期', '快递费', '实发佣金', '推荐奖', '佣金4比例', '佣金4金额', '支付日期', '税后毛利率', '税后毛利', '备注1(真实代理人)', '备注2（长）',
    ]

    static final List<String> COMPANY_HEADERS = [
            '保险单号码/批单号码', '被保险人', '实收保费', '费用比例%', '已结收付费', '结算时间', '车牌号码', '车型名称', '发动机号', '车架号', '出单日期', '是否补点', '是否退保'
    ]
}

