
const messages = [
	{
		index:0,
		id:'0000000',
		name:'漫道名',
		yxt:'盈信通模板号',
		content:'尊敬的车车用户您好，进入雷雨季节请注意行车安全。如遇暴雨，在视线不清楚的情况下，建议打开双闪与雾灯，停靠在安全地带等待雨小后再行驶；如遇路面积水，建议绕道行驶或在安全地带停靠，等待积水褪去后再行驶。车车衷心的祝福您生活和工作开心快乐，关注车车微信号“checheapp”，客服专线4000150999，车车竭诚为您服务${label1}。',
		status:'2222',
		remarks:'备注22222211111111111222222222222222222222222222',
		sendUsers:'发送用户',
		sendData:'已发送，总发送，发送率',
		editor:'董玉文，2015-12-12 13：13：13',
	},
	{
		index:1,
		id:'111111',
		name:'漫道名',
		yxt:'盈信通模板号',
		content:'尊敬的车车用户您好，进入雷雨季节请注意行车安全。如遇暴雨，在视线不清楚的情况下，建议打开双闪与雾灯，停靠在安全地带等待雨小后再行驶；如遇路面积水，建议绕道行驶或在安全地带停靠，等待积水褪去后再行驶。车车衷心的祝福您生活和工作开心快乐，关注车车微信号“checheapp”，客服专线4000150999，车车竭诚为您服务${label1}。',
		status:'2222',
		remarks:'备注22222211111111111222222222222222222222222222',
		sendUsers:'发送用户',
		sendData:'已发送，总发送，发送率',
		editor:'董玉文，2015-12-12 13：13：13',
	},
	{
		index:2,
		id:'222222',
		name:'漫道名',
		yxt:'盈信通模板号',
		content:'尊敬的车车用户您好，进入雷雨季节请注意行车安全。如遇暴雨，在视线不清楚的情况下，建议打开双闪与雾灯，停靠在安全地带等待雨小后再行驶；如遇路面积水，建议绕道行驶或在安全地带停靠，等待积水褪去后再行驶。车车衷心的祝福您生活和工作开心快乐，关注车车微信号“checheapp”，客服专线4000150999，车车竭诚为您服务${label1}。',
		status:'2222',
		remarks:'备注22222211111111111222222222222222222222222222',
		sendUsers:'发送用户',
		sendData:'已发送，总发送，发送率',
		editor:'董玉文，2015-12-12 13：13：13',
	},
	{
		index:3,
		id:'333333',
		name:'漫道名',
		yxt:'盈信通模板号',
		content:'尊敬的车车用户您好，进入雷雨季节请注意行车安全。如遇暴雨，在视线不清楚的情况下，建议打开双闪与雾灯，停靠在安全地带等待雨小后再行驶；如遇路面积水，建议绕道行驶或在安全地带停靠，等待积水褪去后再行驶。车车衷心的祝福您生活和工作开心快乐，关注车车微信号“checheapp”，客服专线4000150999，车车竭诚为您服务${label1}。',
		status:'2222',
		remarks:'备注22222211111111111222222222222222222222222222',
		sendUsers:'发送用户',
		sendData:'已发送，总发送，发送率',
		editor:'董玉文，2015-12-12 13：13：13',
	},
	{
		index:4,
		id:'4444',
		name:'漫道名',
		yxt:'盈信通模板号',
		content:'尊敬的车车用户您好，进入雷雨季节请注意行车安全。如遇暴雨，在视线不清楚的情况下，建议打开双闪与雾灯，停靠在安全地带等待雨小后再行驶；如遇路面积水，建议绕道行驶或在安全地带停靠，等待积水褪去后再行驶。车车衷心的祝福您生活和工作开心快乐，关注车车微信号“checheapp”，客服专线4000150999，车车竭诚为您服务${label1}。',
		status:'2222',
		remarks:'备注22222211111111111222222222222222222222222222',
		sendUsers:'发送用户',
		sendData:'已发送，总发送，发送率',
		editor:'董玉文，2015-12-12 13：13：13',
	},
	{
		index:5,
		id:'55555',
		name:'漫道名',
		yxt:'盈信通模板号',
		content:'尊敬的车车用户您好，进入雷雨季节请注意行车安全。如遇暴雨，在视线不清楚的情况下，建议打开双闪与雾灯，停靠在安全地带等待雨小后再行驶；如遇路面积水，建议绕道行驶或在安全地带停靠，等待积水褪去后再行驶。车车衷心的祝福您生活和工作开心快乐，关注车车微信号“checheapp”，客服专线4000150999，车车竭诚为您服务${label1}。',
		status:'2222',
		remarks:'备注22222211111111111222222222222222222222222222',
		sendUsers:'发送用户',
		sendData:'已发送，总发送，发送率',
		editor:'董玉文，2015-12-12 13：13：13',
	},
	{
		index:6,
		id:'66666',
		name:'漫道名',
		yxt:'盈信通模板号',
		content:'尊敬的车车用户您好，进入雷雨季节请注意行车安全。如遇暴雨，在视线不清楚的情况下，建议打开双闪与雾灯，停靠在安全地带等待雨小后再行驶；如遇路面积水，建议绕道行驶或在安全地带停靠，等待积水褪去后再行驶。车车衷心的祝福您生活和工作开心快乐，关注车车微信号“checheapp”，客服专线4000150999，车车竭诚为您服务${label1}。',
		status:'2222',
		remarks:'备注22222211111111111222222222222222222222222222',
		sendUsers:'发送用户',
		sendData:'已发送，总发送，发送率',
		editor:'董玉文，2015-12-12 13：13：13',
	}
]
const titles = [
	{name:'序号',colSpan:"1"},
	{name:'模板号漫道，盈信通',colSpan:"2"},
	{name:'模板名',colSpan:"2"},
	{name:'短信内容',colSpan:"4"},
	{name:'状态',colSpan:"1"},
	{name:'备注',colSpan:"2"},
	{name:'操作',colSpan:"2"},
];
const searchCfg = {
	size:8,
	total:20,
	index:0,
	search:{
		type:'模板号',
		q:'工作'
	}
}

export let configs = {
	titles:titles,
	messages:messages,
	searchCfg:searchCfg
}
